# Assignment 3: Classification
## Hannah Mencer

In [1]:
# Required Python Machine learning Packages
import pandas as pd
import numpy as np

# To split the dataset into train and test datasets
from sklearn.model_selection import train_test_split

# To model the Gaussian Navie Bayes classifier
from sklearn.naive_bayes import GaussianNB

# To calculate the accuracy score of the model
from sklearn.metrics import accuracy_score
from sklearn.preprocessing import LabelEncoder

import matplotlib.pyplot as plt
%matplotlib inline

ModuleNotFoundError: No module named 'sklearn.cross_validation'

In [2]:
df=pd.read_csv('loan_data.csv')
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [3]:
df.shape

(614, 13)

In [5]:
df.dtypes

Loan_ID               object
Gender                object
Married               object
Dependents            object
Education             object
Self_Employed         object
ApplicantIncome        int64
CoapplicantIncome    float64
LoanAmount           float64
Loan_Amount_Term     float64
Credit_History       float64
Property_Area         object
Loan_Status           object
dtype: object

In [6]:
df.sample(10)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
22,LP001047,Male,Yes,0,Not Graduate,No,2600,1911.0,116.0,360.0,0.0,Semiurban,N
423,LP002362,Male,Yes,1,Graduate,No,7250,1667.0,110.0,NaN,0.0,Urban,N
76,LP001256,Male,No,0,Graduate,No,3750,4750.0,176.0,360.0,1.0,Urban,N
530,LP002717,Male,Yes,0,Graduate,No,1025,5500.0,216.0,360.0,NaN,Rural,Y
153,LP001532,Male,Yes,2,Not Graduate,No,2281,0.0,113.0,360.0,1.0,Rural,N
43,LP001131,Male,Yes,0,Graduate,No,3941,2336.0,134.0,360.0,1.0,Semiurban,Y
202,LP001682,Male,Yes,3+,Not Graduate,No,3992,0.0,NaN,180.0,1.0,Urban,N
124,LP001439,Male,Yes,0,Not Graduate,No,4300,2014.0,194.0,360.0,1.0,Rural,Y
241,LP001800,Male,Yes,1,Not Graduate,No,2510,1983.0,140.0,180.0,1.0,Urban,N
562,LP002820,Male,Yes,0,Graduate,No,5923,2054.0,211.0,360.0,1.0,Rural,Y

In [7]:
df.isnull().sum()

Loan_ID               0
Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [26]:
print("Missing vals before dropping: ")
print(df.shape)

mod=df.dropna(subset=['Married'])
print("Missing vals after dropping: ")
print(mod.shape)

Missing vals before dropping:
(614, 13)
Missing vals after dropping:
(611, 13)

Since there are only 3 missing values for Married, we can drop those.

In [28]:
mod.isnull().sum()

Loan_ID               0
Gender               13
Married               0
Dependents           12
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           21
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

We will use most common value imputation to handle the missing values for these columns. Since Gender, Dependents, Married, and Self_Employed are object datatypes, we'll use the most common value and insert that wherever there is a value of NA. LoanAmount, Loan_Amount_Term, and Credit_History are all float values, so we will replace any value of NA with the mean of each column.

In [37]:
#Gender

df.groupby(['Gender']).agg({'Gender':'count'})

        Gender
Gender
Female     112
Male       489

Male occurs more frequently than female, so we will fill the missing values with 'Male'.

In [40]:
df['Gender'].fillna('Male',inplace=True)

In [50]:
#Married

df.groupby(["Married"]).agg({"Married":"count"})

         Married
Married
No           213
Yes          398

The majority are married, so we'll replace missing values with "Yes".

In [51]:
df["Married"].fillna("Yes",inplace=True)

In [42]:
#Dependents

df.groupby(['Dependents']).agg({'Dependents':'count'})

            Dependents
Dependents
0                  345
1                  102
2                  101
3+                  51

Having 0 dependents is most common, so we will fill every missing value with "0".

In [44]:
df['Dependents'].fillna("0",inplace=True)

In [47]:
#Self_Employed

df.groupby(['Self_Employed']).agg({'Self_Employed':'count'})

               Self_Employed
Self_Employed
No                       500
Yes                       82

The majority are not self-employed, so we'll fill every missing value with "No".

In [48]:
df['Self_Employed'].fillna("No",inplace=True)

In [34]:
#LoanAmount
df['LoanAmount'].fillna(df['LoanAmount'].mean(),inplace=True)

In [29]:
#Loan_Amount_Term
df['Loan_Amount_Term'].fillna(df['Loan_Amount_Term'].mean(),inplace=True)

In [33]:
#Credit_History
df['Credit_History'].fillna(df['Credit_History'].mean(),inplace=True)

In [52]:
df.isnull().sum()

Loan_ID              0
Gender               0
Married              0
Dependents           0
Education            0
Self_Employed        0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Loan_Amount_Term     0
Credit_History       0
Property_Area        0
Loan_Status          0
dtype: int64

# Outliers